//Напишите программу, которая на вход принимает трехзначное число и на выходе показывает последнюю цифру этого числа. работает с любым числом

int num = int.Parse(Console.ReadLine());
Console.WriteLine(num % 10);
